Chapter09/ClaimApps/InsuranceClaimCase/xsd/ClaimTestData.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
     <soap:Body>
          <ns1:startCaseInputMessage xmlns:ns1="http://xmlns.oracle.com/CaseService/types"
                                     xmlns:ns2="http://xmlns.oracle.com/bpm/case">
               <ns2:case>
                    <ns2:caseId>91</ns2:caseId>
                    <ns2:caseHeader>
                         <ns2:caseId>91</ns2:caseId>
                         <ns2:caseNumber>91</ns2:caseNumber>
                         <ns2:caseName>91</ns2:caseName>
                         <ns2:caseDisplayName>91</ns2:caseDisplayName>
                         <ns2:title>91</ns2:title>
                         <ns2:priority>1</ns2:priority>
                         <ns2:createdBy></ns2:createdBy>
                         <ns2:createdByDisplayName>91</ns2:createdByDisplayName>
                         <ns2:createdDate>2012-12-12T00:00:00</ns2:createdDate>
                         <ns2:state>NEW</ns2:state>
                         <ns2:stateDisplayName></ns2:stateDisplayName>
                         <ns2:ecmFolder></ns2:ecmFolder>
                         <ns2:caseDefinitionId>91</ns2:caseDefinitionId>
                         <ns2:caseDefinitionName>91</ns2:caseDefinitionName>
                         <ns2:caseNamespace></ns2:caseNamespace>
                         <ns2:identificationKey>91</ns2:identificationKey>
                         <ns2:category></ns2:category>
                         <ns2:categoryDisplayName></ns2:categoryDisplayName>
                         <ns2:outcome></ns2:outcome>
                         <ns2:outcomeDisplayName></ns2:outcomeDisplayName>
                         <ns2:sca>
                              <ns2:applicationName></ns2:applicationName>
                              <ns2:componentName></ns2:componentName>
                              <ns2:compositeDN></ns2:compositeDN>
                              <ns2:compositeInstanceId></ns2:compositeInstanceId>
                              <ns2:compositeName></ns2:compositeName>
                              <ns2:compositeVersion></ns2:compositeVersion>
                              <ns2:ecid></ns2:ecid>
                              <ns2:parentComponentInstanceId></ns2:parentComponentInstanceId>
                              <ns2:parentComponentInstRefId></ns2:parentComponentInstRefId>
                              <ns2:headerProperties></ns2:headerProperties>
                              <ns2:invokedComponent></ns2:invokedComponent>
                         </ns2:sca>
                         <ns2:caseSummaryFormURI></ns2:caseSummaryFormURI>
                         <ns2:completedCaseActivityList></ns2:completedCaseActivityList>
                         <ns2:userPermissions>
                              <ns2:userId></ns2:userId>
                         </ns2:userPermissions>
                         <ns2:userActions></ns2:userActions>
                    </ns2:caseHeader>
                    <ns2:stakeHolders></ns2:stakeHolders>
                    <ns2:milestones></ns2:milestones>
                    <ns2:data>
                         <ns2:id></ns2:id>
                         <ns2:caseId></ns2:caseId>
                         <ns2:name>ClaimCaseInput</ns2:name>
                         <ns2:displayName></ns2:displayName>
                         <ns2:data>
                              <Claim xmlns="http://www.Claim4Insurance.org">
                                   <DeclainClaim>
                                        <reason></reason>
                                        <comments></comments>
                                   </DeclainClaim>
                                   <Settlement>
                                        <offers>
                                             <uploadOffer></uploadOffer>
                                             <comment></comment>
                                        </offers>
                                        <payments>
                                             <paymentMethod></paymentMethod>
                                             <payeeName></payeeName>
                                             <payeeAddress></payeeAddress>
                                             <memo></memo>
                                        </payments>
                                        <faultSubject>Payment</faultSubject>
                                   </Settlement>
                                   <FNOL>
                                        <lossType>GlassDamage</lossType>
                                        <reportedChannel>Agent</reportedChannel>
                                        <description>GlassDamage</description>
                                        <lossAddress>
                                             <locationType>Parking</locationType>
                                             <addressLine1>Address1</addressLine1>
                                             <addressLine2>Address2</addressLine2>
                                             <addressLine3>Address3</addressLine3>
                                             <city>Miami</city>
                                             <country>UK</country>
                                             <state>FL</state>
                                             <zipCode>33178</zipCode>
                                        </lossAddress>
                                        <lossDetails>
                                             <noOfVehiclesInvolved>2</noOfVehiclesInvolved>
                                             <noOfWitness>1</noOfWitness>
                                             <whoWasDriving>Self</whoWasDriving>
                                             <vehicleTowed>No</vehicleTowed>
                                             <towingRequest>Yes</towingRequest>
                                             <damageDescription>GlassDamage</damageDescription>
                                             <injuryDescription></injuryDescription>
                                             <policeReportFiled>Yes</policeReportFiled>
                                             <policereportNumber>1111</policereportNumber>
                                             <policeDepartment>Miami</policeDepartment>
                                        </lossDetails>
                                        <involvedParties>
                                             <involvementType>Claimant</involvementType>
                                             <partyDetails>Claimant</partyDetails>
                                        </involvedParties>
                                        <serviceProvider>
                                             <providerName></providerName>
                                             <messageSubject></messageSubject>
                                             <messageDetails></messageDetails>
                                        </serviceProvider>
                                        <sensitivity></sensitivity>
                                        <fastTrackFlag></fastTrackFlag>
                                        <claimValidated></claimValidated>
                                        <policyDetails>
                                             <policyName>Auto</policyName>
                                             <policyNumber>1111</policyNumber>
                                             <primaryInsured>Yes</primaryInsured>
                                             <insuredItem>1</insuredItem>
                                        </policyDetails>
                                   </FNOL>
                                   <CloseClaimCase>
                                        <caseCloseDate></caseCloseDate>
                                        <reason></reason>
                                        <comments></comments>
                                   </CloseClaimCase>
                                   <Appraisal>
                                        <examineDamage>
                                             <examineDateTime></examineDateTime>
                                             <address></address>
                                             <claimantPresent></claimantPresent>
                                             <photosUploaded></photosUploaded>
                                        </examineDamage>
                                        <vehicalDetails>
                                             <vehicalBuild></vehicalBuild>
                                             <vehicalDamage></vehicalDamage>
                                        </vehicalDetails>
                                        <estimatedCost>
                                             <estimationCompleted></estimationCompleted>
                                        </estimatedCost>
                                        <declaration></declaration>
                                   </Appraisal>
                                   <Evaluation>
                                        <track></track>
                                   </Evaluation>
                              </Claim>
                         </ns2:data>
                         <ns2:updatedDate>2012-12-12T00:00:00</ns2:updatedDate>
                         <ns2:updatedBy>91</ns2:updatedBy>
                         <ns2:updatedByDisplayName>91</ns2:updatedByDisplayName>
                    </ns2:data>
                    <ns2:comments/>
                    <ns2:caseFabricHeaderProperty></ns2:caseFabricHeaderProperty>
               </ns2:case>
          </ns1:startCaseInputMessage>
     </soap:Body>
</soap:Envelope>

